# "Understanding Workforce Dynamics: A Comprehensive SQL Analysis of Employee Data"

# Objective:
The objective of this project is to analyze the workforce data of an organization in order to derive actionable insights related to employee demographics, performance, tenure, and other key metrics. By executing various SQL queries on the organization’s employee database, we aim to answer a set of business-critical questions that will help in understanding the structure, diversity, performance, and overall distribution of employees within the organization. This analysis will support human resources and management in decision-making processes related to workforce planning, employee development, and retention strategies.

# Key Aims:
Workforce Composition: To understand the total size of the workforce, gender distribution, department size, and employee demographics such as age and education.
Employee Performance: To assess employee performance indicators such as average training scores, job satisfaction, and previous year ratings.
Employee Tenure and Attrition: To identify employee retention patterns, determine the length of service across the organization, and identify regions and departments with the highest number of employee departures.
Income Distribution: To analyze the income distribution across various departments, identify the highest earners, and understand the relationship between job level and compensation.
Training and Development: To evaluate the average training scores by department, education, and other key employee attributes to guide training and development programs.

# Importation of libraries and database connection

In [ ]:
pip install sqlalchemy pymysql

In [ ]:
pip install ipython-sql

In [3]:
#Load the sql extention
%load_ext sql

In [8]:
#Load your mysql db using credentials from the "DB" area
#%sql mysql+pymysql://<user>:<password>@localhost/<db_name>
%sql mysql+pymysql://root:@localhost/Employee_data_Analysis

In [73]:
'''SqlMagic is part of the ipython-sql extension, 
which allows you to run SQL queries directly within Jupyter notebooks'''

%config SqlMagic.style = '_DEPRECATED_DEFAULT'

# How many employees do we have in the organization and what is the maximum length of service?

Objective: The objective of this query is to determine the total number of employees in the organization and to understand the maximum tenure of employees in the organization. This provides insight into the organization’s size and the level of experience across the workforce.

In [72]:
%%sql
select count(*) as num_of_employee, max(length_of_service) as length_of_service from employee_performance
join employee_test on employee_test.employee_id = employee_performance.employee_id;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
1 rows affected.

[(1470, 31)]

# How many employees are there in each department?

Objective: This query answers the question of how many employees are working in each department. Understanding department size is crucial for resource allocation, team management, and workforce planning.

In [17]:
%%sql
select department, count(employee_id) from employee_test
group by department;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
9 rows affected.

[('Analytics', 153),
 ('Finance', 74),
 ('HR', 66),
 ('Legal', 30),
 ('Operations', 291),
 ('Procurement', 183),
 ('R&D', 29),
 ('Sales & Marketing', 446),
 ('Technology', 198)]

# What is the proportion of male to female employees?

Objective: This query analyzes the gender distribution of employees in the organization. Understanding gender proportions can help in fostering a diverse and inclusive workplace.

In [18]:
%%sql
select gender, count(gender) from employee_test
group by gender;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
2 rows affected.

[('f', 401), ('m', 1069)]

# Group Employee age into 5 categories (20 – 29, 30 – 39, 40-49, 50-59, >60) What age group has the highest and lowest employee?

Objective: This query segments employees into age categories, allowing the organization to assess the age distribution. This helps in understanding the workforce's generational makeup, which can influence training, mentorship, and succession planning.

In [24]:
%%sql
select age from employee_test;

Select 
	Case
		when age Between 20 and 29 Then '20 – 29'
		when age Between 30 and 39 Then '30 – 39'
		when age Between 40 and 49 Then '40 - 49'
		when age Between 50 and 59 Then '50 - 59'
		Else '>60'
		end age_group,
		count(*) as Num_of_employee
from employee_test
group by age_group;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
1470 rows affected.
5 rows affected.

[('20 – 29', 388),
 ('30 – 39', 749),
 ('40 - 49', 244),
 ('50 - 59', 82),
 ('>60', 7)]

# Who works in the Finance department?

Objective: This query identifies employees who work specifically in the Finance department. This is useful for targeted interventions or analyses related to specific departments.

In [75]:
%%sql
select employee_id, department from employee_test
where department = 'Finance';

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
74 rows affected.

[(64486, 'Finance'),
 (54542, 'Finance'),
 (8566, 'Finance'),
 (4529, 'Finance'),
 (71131, 'Finance'),
 (41566, 'Finance'),
 (6452, 'Finance'),
 (44117, 'Finance'),
 (8082, 'Finance'),
 (67357, 'Finance'),
 (47252, 'Finance'),
 (22999, 'Finance'),
 (5294, 'Finance'),
 (7561, 'Finance'),
 (29220, 'Finance'),
 (59919, 'Finance'),
 (22403, 'Finance'),
 (58836, 'Finance'),
 (10473, 'Finance'),
 (14980, 'Finance'),
 (27844, 'Finance'),
 (60375, 'Finance'),
 (28711, 'Finance'),
 (9890, 'Finance'),
 (54456, 'Finance'),
 (49181, 'Finance'),
 (7389, 'Finance'),
 (64023, 'Finance'),
 (30356, 'Finance'),
 (52005, 'Finance'),
 (19353, 'Finance'),
 (16986, 'Finance'),
 (28479, 'Finance'),
 (73983, 'Finance'),
 (37573, 'Finance'),
 (62502, 'Finance'),
 (71236, 'Finance'),
 (54053, 'Finance'),
 (65786, 'Finance'),
 (34787, 'Finance'),
 (55184, 'Finance'),
 (6100, 'Finance'),
 (46547, 'Finance'),
 (7474, 'Finance'),
 (4417, 'Finance'),
 (75702, 'Finance'),
 (9251, 'Finance'),
 (40109, 'Finance'),
 (19695, 'Finance'),
 (75902, 'Finance'),
 (22353, 'Finance'),
 (66226, 'Finance'),
 (44749, 'Finance'),
 (41723, 'Finance'),
 (3635, 'Finance'),
 (30940, 'Finance'),
 (54748, 'Finance'),
 (2254, 'Finance'),
 (57880, 'Finance'),
 (15187, 'Finance'),
 (48866, 'Finance'),
 (22553, 'Finance'),
 (41927, 'Finance'),
 (20309, 'Finance'),
 (50237, 'Finance'),
 (8255, 'Finance'),
 (10378, 'Finance'),
 (72844, 'Finance'),
 (8249, 'Finance'),
 (65503, 'Finance'),
 (54678, 'Finance'),
 (65031, 'Finance'),
 (77867, 'Finance'),
 (38238, 'Finance')]

In [77]:
%%sql
select count(employee_id) as total_number_of_employee_in_finance from employee_test
where department = 'Finance';

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
1 rows affected.

[(74,)]

# Who has the highest average training score among all employees?

Objective: Identify the employee with the highest average training score, which can be useful for recognizing top performers and for performance management.

In [26]:
%%sql
select employee_id, avg_training_score from employee_test
order by avg_training_score desc
limit 1;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
1 rows affected.

[(70734, 97)]

# Top 3 regions with the highest number of departures (employees who have left), and what are the corresponding departments?

Objective: Analyze employee attrition by region and department to identify areas with high turnover, which may signal issues such as job dissatisfaction, management concerns, or other regional challenges.

In [80]:
%%sql
select region, count(employee_test.employee_id) from employee_test
inner join employee_performance
on employee_test.employee_id = employee_performance.employee_id
where attrition = 'Yes'
group by region
order by count(employee_test.employee_id) desc
limit 3;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
3 rows affected.

[('region_2', 46), ('region_22', 24), ('region_26', 16)]

# Which department has the most employees, and which department has the fewest employees?

Objective: Determine the department with the highest and lowest number of employees. This information is useful for assessing workforce distribution and planning.

In [81]:
%%sql
select department, count(employee_id) from employee_test
group by department
order by count(employee_id) asc;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
9 rows affected.

[('R&D', 29),
 ('Legal', 30),
 ('HR', 66),
 ('Finance', 74),
 ('Analytics', 153),
 ('Procurement', 183),
 ('Technology', 198),
 ('Operations', 291),
 ('Sales & Marketing', 446)]

# Who are the top 5 highest-earning employees in the 'Technology' department?

Objective: Identify the top 5 highest-earning employees in the Technology department to support compensation analysis, salary benchmarking, and reward strategies.

In [32]:
%%sql
select employee_performance.employee_id, monthlyincome, department
from employee_performance
inner join employee_test
on employee_performance.employee_id = employee_test.employee_id
where department = 'Technology'
order by monthlyincome desc
limit 5;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
5 rows affected.

[(40814, 19740, 'Technology'),
 (68267, 19627, 'Technology'),
 (18640, 19392, 'Technology'),
 (25879, 19331, 'Technology'),
 (49192, 19189, 'Technology')]

# Names of departments with awards, and the numbers of awards for each departments

Objective: Identify employees who have won awards and work in departments with more than 10 employees. This analysis could help understand the distribution of awards across departments.

In [42]:
%%sql
select department, count(awards_won) AS num_awards
from employee_test
group BY department, awards_won
order by num_awards ASC;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
17 rows affected.

[('Finance', 1),
 ('HR', 1),
 ('R&D', 1),
 ('Analytics', 4),
 ('Procurement', 5),
 ('Technology', 5),
 ('Operations', 7),
 ('Sales & Marketing', 9),
 ('R&D', 28),
 ('Legal', 30),
 ('HR', 65),
 ('Finance', 73),
 ('Analytics', 149),
 ('Procurement', 178),
 ('Technology', 193),
 ('Operations', 284),
 ('Sales & Marketing', 437)]

# Who are the employees with awards in departments with more than 10 employees, and what are their department names?

Objective: Identify employees who have won awards and work in departments with more than 10 employees. This analysis could help understand the distribution of awards across departments.

In [100]:
%%sql
SELECT employee_id
FROM employee_test
WHERE department IN (
    SELECT department
    FROM employee_test
    GROUP BY department
    HAVING COUNT(*) > 10
)
limit 10

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
10 rows affected.

[(8724,),
 (74430,),
 (72255,),
 (38562,),
 (64486,),
 (46232,),
 (54542,),
 (67269,),
 (66174,),
 (76303,)]

# What is the average training score of employees in each department

Objective: This query calculates the average training score of employees in each department, allowing for targeted improvements in training programs based on departmental needs.

In [44]:
%%sql
select department, round(avg(avg_training_score),2) from employee_test
group by department;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
9 rows affected.

[('Analytics', Decimal('84.82')),
 ('Finance', Decimal('59.97')),
 ('HR', Decimal('49.86')),
 ('Legal', Decimal('60.60')),
 ('Operations', Decimal('60.59')),
 ('Procurement', Decimal('69.73')),
 ('R&D', Decimal('84.83')),
 ('Sales & Marketing', Decimal('49.84')),
 ('Technology', Decimal('80.02'))]

# What is the average previous year rating by department?

Objective: Assess the average performance ratings of employees within each department to gauge the overall performance level across the organization.

In [45]:
%%sql
select department, round(avg(previous_year_rating),2) from employee_test
group by department;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
9 rows affected.

[('Analytics', 3.29),
 ('Finance', 3.24),
 ('HR', 2.91),
 ('Legal', 2.6),
 ('Operations', 3.49),
 ('Procurement', 3.07),
 ('R&D', 3.66),
 ('Sales & Marketing', 2.88),
 ('Technology', 2.76)]

# What is the average training score of employees by education type?

Objective: Analyze how training performance varies across different education types, which can help in designing tailored training programs for various employee education levels.

In [46]:
%%sql
select education, round(avg(avg_training_score),2) from employee_test
group by education;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
4 rows affected.

[('', Decimal('57.90')),
 ("Bachelor's", Decimal('63.27')),
 ('Below Secondary', Decimal('65.71')),
 ("Master's & above", Decimal('64.99'))]

# Group Average training score into grades (A,B,C,D,E,F) and what grade had the highest and lowest number of employees

Objective: Categorize employees based on their training scores and assess the distribution of performance grades across the workforce.

In [47]:
%%sql
select
	Case
		when avg_training_score < 39 then 'E'
		when avg_training_score between 40 and 49 then 'D'
		when avg_training_score between 50 and 69 then 'C'
		when avg_training_score between 70 and 79 then 'B'
		when avg_training_score between 80 and 100 then 'A'
		end grade,
		count(employee_id)
from employee_test
group by grade;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
4 rows affected.

[('A', 299), ('B', 200), ('C', 718), ('D', 253)]

# Which three departments have the highest job satisfaction among employees with a Bachelor's degree?

In [60]:
%%sql
select department, jobSatisfaction from employee_performance
inner join employee_test on employee_performance.employee_id = employee_test.employee_id
where education = "Bachelor's"
group by department
limit 3;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
3 rows affected.

[('Analytics', 3), ('Finance', 2), ('HR', 2)]

# What is the average previous year rating by recruitment channel?

In [61]:
%%sql
select recruitment_channel, round(avg(previous_year_rating),2) from employee_test
group by recruitment_channel;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
3 rows affected.

[('other', 3.08), ('referred', 3.5), ('sourcing', 3.06)]

# What is the split of gender by the previous year rating?

In [62]:
%%sql
select gender, count(previous_year_rating) from employee_test
group by gender;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
2 rows affected.

[('f', 401), ('m', 1069)]

# Based on the age group created what is the average previous year rating and average training score.

In [63]:
%%sql
select
	Case
		when age Between 20 and 29 Then '20 – 29'
		when age Between 30 and 39 Then '30 – 39'
		when age Between 40 and 49 Then '40 - 49'
		when age Between 50 and 59 Then '50 - 59'
		Else '>60'
		end age_group,
		round(avg(previous_year_rating),2),
		round(avg(avg_training_score),2)
from employee_test
group by age_group;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
5 rows affected.

[('20 – 29', 2.4, Decimal('64.37')),
 ('30 – 39', 3.3, Decimal('63.36')),
 ('40 - 49', 3.34, Decimal('62.50')),
 ('50 - 59', 3.5, Decimal('65.12')),
 ('>60', 3.43, Decimal('60.71'))]

# What is the average age of male and female employees, and how many employees are there for each gender?

In [64]:
%%sql
select gender, round(avg(age)), count(*) from employee_test
group by gender;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
2 rows affected.

[('f', Decimal('36'), 401), ('m', Decimal('35'), 1069)]

# Who are the top 5 highest-earning employees with a JobLevel of 3 or higher?

In [67]:
%%sql
select employee_id, monthlyincome, joblevel from employee_performance
where joblevel = 3
order by monthlyincome desc
limit 5;

 * mysql+pymysql://root:***@localhost/Employee_data_Analysis
5 rows affected.

[(58785, 13757, 3),
 (44085, 13744, 3),
 (75833, 13675, 3),
 (10732, 13664, 3),
 (10860, 13610, 3)]